[
  {
    "toyId": 1,
    "toyName": "Lego Classic Bricks",
    "sellerName": "Toys R Us Local",
    "sellerEmail": "contact@toysruslocal.com",
    "price": 49.99,
    "rating": 4.7,
    "availableQuantity": 75,
    "description": "The **Lego Classic Bricks** set is a timeless foundation for endless creativity and a cornerstone of any child's toy collection. This particular set comes packed with a generous assortment of over 790 brightly colored bricks in a spectrum of 33 different colors, including various sizes and specialty pieces such as windows, doors, wheels, and eye elements. The pieces are all designed to be compatible with every other genuine Lego set ever produced, ensuring its utility is perpetual and can grow with your child's ever-expanding collection. The high-quality, durable ABS plastic ensures each brick is robust, can withstand countless hours of play, and maintains its satisfying 'clutch power' for secure builds. The set is presented in a sturdy, reusable plastic storage box, making cleanup and organization simple and encouraging children to keep their creative space tidy.\n\nMore than just plastic pieces, this set is a powerful tool for **STEAM** (Science, Technology, Engineering, Arts, and Mathematics) learning. When children snap bricks together, they are developing critical spatial reasoning and engineering skills. The open-ended nature of the set eliminates prescriptive play, allowing the child's imagination to be the sole limit. It fosters **problem-solving** as kids figure out how to make their structures stable, and enhances **fine motor skills** and **hand-eye coordination** as they precisely manipulate the smaller pieces. From a developmental perspective, it is unparalleled in encouraging **narrative development**; a simple pile of bricks quickly becomes a fantastical castle, a bustling city, or a futuristic spaceship, complete with intricate backstories.\n\nThis classic set is designed for a wide age range, offering progressively complex play. A younger child may simply focus on color sorting or stacking tall, unstable towers, developing early concepts of balance and gravity. An older child might embark on ambitious architectural projects, recreating real-world landmarks or designing original, mechanically functional vehicles. The set includes a small guide with initial building ideas to spark inspiration, but the true value lies in the freedom to deviate and innovate. It’s also an excellent medium for **collaborative play**, encouraging siblings or friends to work together, share resources, and negotiate design choices, which are crucial social skills. We believe in the longevity of this toy; it’s one that will be passed down through generations, a testament to its enduring quality and educational value. The plastic materials are non-toxic, thoroughly tested, and meet all international safety standards, making it a purchase you can feel good about for its quality, safety, and immense potential for creative growth.",
    "pictureURL": "https://ibb.co.com/4w8K3qQp",
    "subCategory": "Building Blocks"
  },
  {
    "toyId": 2,
    "toyName": "Remote Control Stunt Car",
    "sellerName": "Tech Toy Shop",
    "sellerEmail": "support@techtoys.net",
    "price": 35.50,
    "rating": 4.5,
    "availableQuantity": 120,
    "description": "The **Remote Control Stunt Car** is engineered for adrenaline and high-octane fun, offering much more than a standard RC vehicle. This innovative toy is designed with a unique, flexible chassis and large, robust rubber tires that allow it to perform spectacular gravity-defying maneuvers. Capable of executing flawless 360-degree spins, incredible flips, and running equally well on both sides, this stunt car turns any flat surface into a personal skate park. Its powerful motor system allows for impressive speed and rapid acceleration, giving the user total control over complex, dynamic movements. The durable, impact-resistant ABS shell protects the internal components from the inevitable bumps, crashes, and tumbles that come with aggressive stunt driving, ensuring the car’s longevity even with rigorous play.\n\nThe car operates on a reliable $2.4\text{ GHz}$ frequency controller, which prevents signal interference and allows multiple cars to be operated simultaneously without a hitch, making it perfect for competitive racing with friends. The control itself is ergonomically designed for small hands, featuring intuitive joystick and button controls that offer a smooth learning curve for beginners while providing the precision demanded by more experienced drivers. The vehicle is powered by a high-capacity rechargeable lithium battery, offering extended play sessions and eliminating the need for constant battery replacement, while the controller typically requires two standard AA batteries (not included). A USB charging cable is provided for convenient and quick recharging.\n\nBeyond pure entertainment, the stunt car helps develop critical cognitive and physical skills. Operating an RC vehicle significantly enhances **hand-eye coordination** and **spatial awareness**, as the child must constantly gauge distance, speed, and trajectory to navigate obstacles and perform stunts successfully. It teaches **cause and effect** and introduces basic concepts of physics, such as momentum and friction, in a fun and tangible way. Moreover, learning to master the complex controls builds **patience** and **persistence**, encouraging children to practice until they can execute a perfect stunt. The car is suitable for various terrains, from smooth indoor floors to rough outdoor asphalt, extending the play area beyond the confines of a single room. It encourages active, outdoor play, pulling kids away from screens and into a world of physical exploration and fun competition. Our commitment to safety means all components are non-toxic, and the charging system is designed with safety overrides to prevent overheating, guaranteeing a secure and thrilling play experience for all users.",
    "pictureURL": "https://i.ibb.co.com/hJnpFFZD/d2.png",
    "subCategory": "Vehicles"
  },
  {
    "toyId": 3,
    "toyName": "Acoustic Toy Guitar",
    "sellerName": "Music Makers Inc.",
    "sellerEmail": "sales@musicmakers.org",
    "price": 22.00,
    "rating": 4.2,
    "availableQuantity": 90,
    "description": "The **Acoustic Toy Guitar** is the perfect entry point for an aspiring young musician, a carefully scaled-down instrument designed to provide a genuine, foundational musical experience rather than just a noise-making toy. This six-string guitar is constructed from a lightweight yet sturdy blend of high-quality, sustainably-sourced woods, giving it a resonant, bright acoustic sound far superior to typical plastic toy guitars. Its size is specifically tailored for children aged 3 to 7, making it comfortable to hold and play without being unwieldy. A key feature that elevates this above a novelty toy is the inclusion of **real, adjustable tuning pegs**. While the strings are nylon for safety and softer fingers, the ability to tune the guitar allows children to experience pitch, intonation, and harmony firsthand, a fundamental aspect of musical learning. This ensures the sound produced is melodious and not discordant, fostering a positive association with music from the start.\n\nLearning to play an instrument offers profound cognitive benefits. Engaging with the toy guitar enhances **auditory processing skills** as children learn to distinguish between different notes and chords. It significantly boosts **fine motor dexterity** and **bilateral coordination**, as one hand must fret the chords while the other strums or picks the strings, a complex task that strengthens neural connections. Furthermore, practicing an instrument, even a toy one, instills a strong sense of **discipline and achievement**. Starting with simple melodies or a few basic chords (like C, G, and D, which can be taught easily) provides immediate, rewarding feedback, building the child's **self-esteem** and encouraging them to pursue more challenging musical endeavors. The guitar also serves as a fantastic prop for imaginative play, turning the child into a rock star, a folk singer, or a camp musician, encouraging public speaking and performance skills in a low-pressure setting.\n\nTo help get started, the guitar comes packaged with a small introductory booklet that features simple, color-coded chord diagrams and a few easy-to-learn songs. The nylon strings are gentle on young fingertips, reducing discomfort and encouraging longer practice sessions. The overall construction is designed for durability to withstand the rigors of child's play, featuring a non-toxic, child-safe finish. Investing in a real-action instrument like this toy guitar from Music Makers Inc. is an investment in a child’s creative development and a fantastic way to introduce them to the lifelong joy of making music. It makes a beautiful, functional addition to any playroom and sets the stage for a potential future in the arts.",
    "pictureURL": "https://i.ibb.co.com/jvHx7V2L/d3.png",
    "subCategory": "Musical Instruments"
  },
  {
    "toyId": 4,
    "toyName": "Wooden Jigsaw Puzzle (Farm)",
    "sellerName": "Eco Play Toys",
    "sellerEmail": "hello@ecoplay.com",
    "price": 15.99,
    "rating": 4.9,
    "availableQuantity": 150,
    "description": "The **Wooden Jigsaw Puzzle (Farm)** is a beautiful and intentionally designed educational toy from Eco Play Toys, created with both child development and environmental sustainability in mind. This puzzle features 36 chunky, easy-to-handle pieces that come together to form a vibrant, engaging scene of a lively farm, complete with colorful representations of common farm animals like cows, chickens, pigs, and sheep, alongside a classic red barn and tractor. The pieces are crafted from high-quality, sustainably harvested birch wood, ensuring they are robust, highly durable, and resistant to warping or fraying. Each piece is meticulously sanded smooth and finished with non-toxic, child-safe, water-based paints, resulting in a product that is safe for toddlers and young children to explore with their hands and even their mouths.\n\nThe tactile experience of wooden puzzles is crucial for early development. The large size and thickness of the 36 pieces are specifically engineered to accommodate developing **fine motor skills** and the emergent **pincer grip**. As a child manipulates and rotates the pieces, they strengthen the small muscles in their hands and fingers, which are foundational for future tasks like writing and self-feeding. The act of finding the correct interlocking piece is a potent exercise in **cognitive development**, specifically enhancing **spatial reasoning** and **problem-solving** skills. The child must analyze shapes, compare them to the overall image, and mentally rotate them to fit the empty space, a complex cognitive process presented as fun and engaging play.\n\nThe 'Farm' theme is not merely decorative; it serves as a powerful **educational tool**. It encourages early **language development** as parents and children discuss the animals, their sounds, and their names, as well as the different parts of the farm environment. The vivid colors and detailed illustrations promote **visual discrimination** and **object recognition**. Furthermore, completing a puzzle, even a 36-piece one, provides a significant and concrete sense of **achievement**, which builds **confidence** and fosters a positive attitude toward challenging tasks. This Eco Play Toys puzzle is an heirloom-quality product, packaged in an attractive, durable box for easy storage. Our commitment to eco-friendly practices ensures that while your child is learning and growing, you are also making a responsible choice for the planet, distinguishing this as a premium, thoughtfully-made toy that will withstand years of enthusiastic play and discovery.",
    "pictureURL": "https://i.ibb.co.com/35BK3vvL/d4.webp",
    "subCategory": "Puzzles"
  },
  {
    "toyId": 5,
    "toyName": "Dollhouse Miniature Set",
    "sellerName": "The Dollhouse Store",
    "sellerEmail": "service@dollhouse.co",
    "price": 79.95,
    "rating": 4.6,
    "availableQuantity": 45,
    "description": "The **Dollhouse Miniature Set** is an exquisite, multi-level home that serves as a detailed canvas for imaginative and social-emotional play. This comprehensive set is a fully furnished, open-sided structure crafted from high-quality, non-toxic wood and composite materials, designed for stability and years of play. It features multiple distinct rooms, including a bedroom, kitchen, living room, and bathroom, each rendered in meticulous, colorful detail to spark the imagination. Included with the dollhouse is a curated collection of over 25 miniature furniture pieces and small figures, representing a diverse family of dolls. The attention to detail is evident in everything from the tiny working doors and windows to the intricately painted wallpaper and flooring, creating a realistic and inviting environment for storytelling.\n\nDollhouse play is a powerful catalyst for **social and emotional development**. By manipulating the figures and orchestrating domestic scenes, children naturally engage in **role-playing**, which allows them to safely process and understand the complex social dynamics and family relationships they observe in the real world. They act out scenarios of conflict, cooperation, caregiving, and daily routines, developing a deeper sense of **empathy** and **perspective-taking** by literally walking in someone else's miniature shoes. This type of play is also critical for **language development**; as they narrate the dolls' lives, children dramatically expand their vocabulary and improve their storytelling abilities and sentence structure.\n\nFrom a technical perspective, setting up the miniature furniture and arranging the accessories fine-tunes **fine motor skills** and **spatial awareness**. Children learn about scale and proportion as they decide where objects should be placed within the rooms. The open-ended nature of the dollhouse guarantees exceptional replay value, as the story changes every time the child sits down to play. It can be a historical mansion one day and a modern apartment the next, depending on the child's current interest. This set is a true centerpiece for the playroom, encouraging both solitary, focused play and collaborative interaction with friends, fostering valuable communication skills. The commitment from The Dollhouse Store to safety is paramount, ensuring all paints and materials are lead-free and non-hazardous, providing a beautiful, safe, and developmentally rich environment for any child's imagination to flourish. The quality construction means this set is durable enough to be enjoyed for many years, offering a miniature world of possibilities.",
    "pictureURL": "https://i.ibb.co.com/B5znBq2n/d5.png",
    "subCategory": "Dolls & Accessories"
  },
  {
    "toyId": 6,
    "toyName": "Science Explorer Kit",
    "sellerName": "Mad Scientist Supply",
    "sellerEmail": "orders@madsci.com",
    "price": 65.00,
    "rating": 4.8,
    "availableQuantity": 60,
    "description": "The **Science Explorer Kit** is an all-encompassing launchpad into the exciting world of experimental science, curated by Mad Scientist Supply to spark a lifelong curiosity in young learners. This deluxe kit is packed with the necessary, child-safe components to conduct over 20 fascinating and diverse experiments, covering fundamental principles of chemistry, geology, and physics. Projects range from the dramatic **volcano eruption** (using simple, safe household ingredients) and the slow, satisfying growth of **colorful crystals** to creating simple circuits, performing color-changing chemical reactions, and understanding the concept of density through flotation experiments. Every component is rigorously tested for safety and packaged securely, with clear labeling.\n\nThe kit truly turns a child's playroom or kitchen table into a miniature, functioning lab. It includes essential laboratory gear scaled for children: a real, albeit pint-sized, **lab coat** and protective **goggles** (encouraging safety practices from the start), beakers, test tubes, pipettes, measuring spoons, and various non-hazardous chemical powders and solutions. The included 40-page instruction manual is a key educational component; it's written in engaging, child-friendly language, featuring detailed, step-by-step instructions for each experiment, alongside simple, clear explanations of the scientific principles at work. This ensures the activity is not just a 'magic trick,' but a genuine learning experience.\n\nFrom a developmental standpoint, this kit is exceptional for fostering **critical thinking** and the **scientific method**. Children learn to form hypotheses, follow complex procedures carefully, observe changes, and record results, all foundational skills for academic success. It dramatically enhances **problem-solving skills** and encourages **patience** and **precision**—key traits for successful experimentation. The hands-on nature of the experiments makes abstract scientific concepts concrete and understandable, bringing lessons from the classroom to life. It’s an ideal toy for collaborative projects, allowing children and parents to bond over shared discovery. The Science Explorer Kit is not just a one-time toy; it's a reusable set of tools that encourages repeated experimentation and independent exploration long after the initial 20 projects are complete, helping to cultivate the next generation of scientists and innovators by proving that learning can be both educational and explosively fun. All materials are non-toxic and designed to be compatible with common kitchen ingredients for easy replenishment and endless, safe exploration.",
    "pictureURL": "https://i.ibb.co.com/MkQsdx5z/d6.png",
    "subCategory": "Educational"
  },
  {
    "toyId": 7,
    "toyName": "Fuzzy Bear Plush Toy",
    "sellerName": "Cuddle Buddy Co.",
    "sellerEmail": "contact@cuddlebuddy.net",
    "price": 19.99,
    "rating": 5.0,
    "availableQuantity": 200,
    "description": "The **Fuzzy Bear Plush Toy** from Cuddle Buddy Co. is the epitome of comfort and companionship, designed to be a child's most cherished friend and reliable snuggle partner. Standing at a substantial and huggable 18 inches tall, this bear is crafted from a unique, ultra-soft, and luxurious faux fur that has been triple-brushed for a cloud-like texture, making it irresistible to touch and hold. Its weighted bottom allows it to sit up on its own, adding a touch of realism and making it a comforting presence in a child's room. Every detail, from the soft, embroidered eyes and nose (eliminating small, hard plastic parts) to the gentle, slightly floppy limbs, is designed with safety and maximum cuddlability in mind.\n\nOur commitment to sustainability and quality sets this plush toy apart: the bear is made from **100% recycled materials**, including the polyester fiberfill, making it an eco-conscious choice that teaches children the value of sustainability right from their toy chest. It is entirely safe for all ages, meeting the strictest international standards for infant toys, which means it is non-toxic, flame-retardant, and free of choking hazards. The construction is incredibly robust, featuring reinforced stitching that can withstand the intense love, dragging, and frequent washing (it’s fully machine-washable!) that a favorite plush toy inevitably endures.\n\nFrom a developmental perspective, a plush toy like Fuzzy Bear is vital for a child's **social and emotional growth**. It acts as a transitional object, providing a constant source of **security and comfort** in new or challenging situations, such as bedtime, doctor's visits, or starting a new school. This bear is often the first listener for a child's fears and secrets, serving as a non-judgmental confidante that helps children process their feelings and develop **empathy** and **nurturing skills** as they care for their companion. Through imaginative play, the bear becomes a character in countless stories, helping to foster **narrative and language development**. Its consistently high 5.0-star rating reflects the profound bond children form with this plush, cementing its status as an essential, high-quality, and environmentally responsible childhood staple. Fuzzy Bear is more than just a toy; it's a silent partner in growth and a forever friend.",
    "pictureURL": "https://i.ibb.co.com/rRTgx8DP/d7.png",
    "subCategory": "Stuffed Animals"
  },
  {
    "toyId": 8,
    "toyName": "Art Easel Double-Sided",
    "sellerName": "Creative Kids Supplies",
    "sellerEmail": "shop@creativekids.com",
    "price": 45.90,
    "rating": 4.4,
    "availableQuantity": 55,
    "description": "The **Art Easel Double-Sided** is a versatile and essential piece of equipment for fostering creativity and academic skill-building in young children. Crafted from sturdy, high-quality pine wood with a child-safe finish, this easel is designed for long-lasting use and stability. Its standout feature is its dual functionality: one side features a large, traditional **chalkboard**, perfect for practicing letters, numbers, and free-form chalk drawing, and the reverse side is a smooth, easy-to-clean **dry-erase board**, ideal for marker drawing, magnetic letters (not included), and more polished presentations. This double-sided design allows for two children to draw and play simultaneously, encouraging **collaborative creativity** and shared learning, which is excellent for sibling interaction or playdates.\n\nA crucial practical element is the easel's **height-adjustable** feature. Utilizing simple, secure turn-knobs, the easel can be easily set to accommodate toddlers practicing their initial scribbles right up to elementary school children refining their artistic techniques, ensuring the product remains relevant and ergonomically correct for many years of growth. Beneath the art surfaces is a generously sized **storage tray**, an indispensable feature for keeping chalk, markers, erasers, and other art supplies organized and easily accessible. This feature not only aids in play but also gently encourages children to develop **organizational skills** and a sense of responsibility for their creative tools.\n\nThe act of drawing and writing on a vertical surface provides unique developmental benefits. It strengthens **shoulder and wrist stability**, which are foundational for proper pencil grip and future handwriting stamina. It enhances **gross motor skills** as children use their entire arm to draw large, sweeping shapes, and it dramatically improves **fine motor control** when they move to detailed work. Furthermore, the easel is a powerful tool for early literacy and numeracy. Children can practice their ABCs and 123s on the chalkboard side, making the learning process fun and tactile. By engaging in artistic expression, children also boost their **self-expression**, **confidence**, and ability to communicate complex ideas visually. The easel from Creative Kids Supplies is not just an art tool; it’s a versatile educational station that supports a child's complete developmental journey from motor skills to intellectual and creative growth.",
    "pictureURL": "https://i.ibb.co.com/4xKYdTL/d8.png",
    "subCategory": "Arts & Crafts"
  },
  {
    "toyId": 9,
    "toyName": "Marble Run Construction Set",
    "sellerName": "Gravity Games",
    "sellerEmail": "hello@gravitygames.com",
    "price": 39.99,
    "rating": 4.7,
    "availableQuantity": 85,
    "description": "The **Marble Run Construction Set** is an incredible, highly engaging STEM (Science, Technology, Engineering, and Mathematics) toy that cleverly disguises complex learning as exciting, hands-on play. This extensive set includes **100 interlocking, translucent plastic track pieces**—including smooth straightaways, curved funnels, swirling centrifugal pieces, and various drops and connectors—allowing for the construction of countless unique and complex marble mazes. The quality of the plastic is excellent, featuring smooth edges and a secure, precise locking mechanism for stable, gravity-defying structures that won't easily collapse mid-run. Also included are a generous supply of brightly colored glass marbles to test the finished tracks.\n\nThe central educational benefit of this toy lies in its direct, tangible introduction to **physics and engineering concepts**. As children design and build their marble runs, they are actively experimenting with gravity, momentum, potential and kinetic energy, and velocity. They are required to troubleshoot and problem-solve: *Why did the marble stop here?* *How do I make the track steeper to increase speed?* *Where should the supporting columns go to ensure stability?* This iterative process of design, testing, and modification is the essence of engineering, fostering powerful **critical thinking** and **spatial reasoning** skills. The transparent pieces are a brilliant feature, as they allow children to visually track the marble's journey, making the underlying physics explicitly clear and demonstrating cause and effect in real-time.\n\nThe set comes with a full-color instructional booklet that offers various build ideas, from simple starter tracks to monumental, intricate towers, providing a helpful scaffold for builders of all skill levels. However, the greatest value is found in the open-ended building, which encourages **creativity** and **independent innovation**. The vibrant, interlocking system also develops advanced **fine motor skills** and **patience** as builders must carefully connect the pieces to ensure a seamless track. Furthermore, the Marble Run is an exceptional toy for **collaborative play**, with children working together to design and construct the biggest and fastest track, learning to communicate and share ideas. Gravity Games ensures the materials are non-toxic and durable, providing a safe, challenging, and endlessly repeatable activity that will grow in complexity with the child’s developing scientific understanding, cementing its place as an outstanding STEM resource.",
    "pictureURL": "https://i.ibb.co.com/mC1pGC0Z/d9.webp",
    "subCategory": "Building Blocks"
  },
  {
    "toyId": 10,
    "toyName": "T-Rex Action Figure",
    "sellerName": "Dino World Toys",
    "sellerEmail": "rex@dinoworld.biz",
    "price": 12.50,
    "rating": 4.1,
    "availableQuantity": 180,
    "description": "The **T-Rex Action Figure** from Dino World Toys is an imposing and highly detailed representation of the most famous prehistoric predator, designed to fuel the endless fascination children have with dinosaurs. This is not a small, static toy; it is a large, substantial figure (approximately 14 inches long) crafted from durable, non-toxic PVC plastic with an emphasis on **realistic detailing**. The figure boasts an impressive, hand-painted texture that mimics the rough, scaly hide of the Tyrannosaurus Rex, complete with scientifically accurate coloration and menacing features. The attention to detail extends to the articulated joints—including the jaw, arms, and legs—allowing for a wide range of lifelike poses for dynamic play and realistic battle scenes.\n\nWhat truly brings this T-Rex to life is the **realistic roar sounds** activated by a small, discreet button. This auditory element enhances the dramatic play experience, fully immersing the child in the Cretaceous period. The figure is built to last, capable of withstanding the rigors of enthusiastic play, from indoor stomping across the living room carpet to outdoor adventures in the sandbox. While it is durable enough for action, the detail is fine enough to appeal to older children and novice collectors, making it a toy with broad appeal and lasting value.\n\nPlaying with dinosaur figures like this T-Rex is highly beneficial for **imaginative and narrative development**. Children use the figure to create complex storylines, often revolving around the predator-prey relationship or heroic struggles, which significantly boosts their **language skills** and ability to construct detailed narratives. The dinosaur theme itself is a fantastic educational gateway, inspiring an interest in **paleontology, history, and natural science**. It encourages research and curiosity, prompting children to ask questions about the T-Rex’s diet, habitat, and extinction. Furthermore, manipulating the large figure and its articulated joints helps to develop **gross and fine motor skills**. The sheer scale and presence of the T-Rex action figure make it a captivating toy that stimulates both intellectual curiosity and thrilling playtime adventures, ensuring that children are entertained while subtly absorbing knowledge about the fascinating world that existed millions of years ago. Dino World Toys guarantees this figure meets all safety standards for children ages 3 and up.",
    "pictureURL": "https://i.ibb.co.com/Y7gyhnTK/d10.png",
    "subCategory": "Action Figures"
  },
  {
    "toyId": 11,
    "toyName": "Portable Basketball Hoop",
    "sellerName": "Sports Fun Gear",
    "sellerEmail": "sales@sportsfun.net",
    "price": 99.00,
    "rating": 4.3,
    "availableQuantity": 30,
    "description": "The **Portable Basketball Hoop** from Sports Fun Gear is the ideal solution for bringing the excitement of basketball right into your backyard or driveway, offering a complete and adjustable playing system for developing athletes. This robust system features a durable, weather-resistant plastic base that can be easily stabilized by filling it with either sand or water, providing a solid foundation that can withstand powerful shots and spirited play. The backboard is made from high-density, shatterproof polyethylene, ensuring longevity and safety, and the rim is fitted with a durable, all-weather nylon net that is built to last through all four seasons.\n\nCrucially, this hoop is designed with an **adjustable height mechanism** that is simple for adults to operate, smoothly transitioning from a low height suitable for young children (around $6.5$ feet) to the regulation junior height (up to $8.5$ feet). This feature is vital as it allows the hoop to grow with your child, accommodating their skill development and ensuring that the challenge remains appropriate, thereby maximizing the product's lifespan and value. The wheels integrated into the base make the entire unit surprisingly easy to tilt and roll to a new location, whether for storage or repositioning, living up to its 'Portable' name.\n\nFrom a physical development perspective, basketball is an exceptional sport. Playing with this hoop helps children develop critical **gross motor skills**, including running, jumping, and pivoting. It dramatically enhances **hand-eye coordination** and **spatial awareness** as players learn to calculate the trajectory needed to sink the ball through the hoop. Furthermore, it instills crucial life skills: it teaches the importance of **practice, patience, and perseverance** as children work to improve their shooting accuracy. It encourages **outdoor, active play**, promoting physical fitness and healthy habits while reducing screen time. Whether used for competitive games, friendly one-on-one sessions, or simply practicing free throws, this portable hoop offers a safe, accessible, and high-quality way to introduce and cultivate a love for the game of basketball, promising countless hours of healthy activity and fun competition for the whole family.",
    "pictureURL": "https://i.ibb.co.com/QjvWYYPw/d11.png",
    "subCategory": "Outdoor Play"
  },
  {
    "toyId": 12,
    "toyName": "Magnetic Dress-Up Doll",
    "sellerName": "Fashion Play Toys",
    "sellerEmail": "contact@fashionplay.com",
    "price": 25.99,
    "rating": 4.5,
    "availableQuantity": 110,
    "description": "The **Magnetic Dress-Up Doll** set from Fashion Play Toys is a fantastic, modern twist on a classic toy, combining creative expression with tactile, satisfying play. The core of the set is a sturdy, high-quality wooden doll figure, standing approximately 9 inches tall, which acts as the 'model.' The magic lies in the over **40 magnetic clothing pieces and accessories** that accompany the doll. These pieces include a wide variety of outfits—from casual wear and professional uniforms to glamorous evening gowns and fantasy costumes—along with hats, shoes, bags, and jewelry, all brightly colored and intricately detailed.\n\nEach clothing piece has a small, strong magnetic backing, allowing children to effortlessly place, stack, and quickly change the doll's ensemble with a satisfying 'click.' This seamless interchangeability encourages rapid experimentation and endless mix-and-match fun, leading to hundreds of potential outfit combinations. The entire collection is conveniently housed in a durable, compartmentalized wooden box or case, making it easy to keep the small pieces organized, perfect for travel, and simple for a child to clean up independently.\n\nThis toy is a significant booster for several key areas of early childhood development. Firstly, the precise act of placing the small magnetic garments onto the doll is an excellent exercise for refining **fine motor skills** and **hand-eye coordination**. Secondly, the core activity of dressing and styling the doll enhances **creativity** and **personal expression**, allowing children to explore colors, patterns, and fashion concepts without any mess. Thirdly, the open-ended role-playing fostered by the doll is crucial for **narrative development** and **social-emotional growth**. Children give their doll a life and a career, creating stories about where she is going and what she is doing, which dramatically expands their vocabulary and their ability to think abstractly and empathize with different roles. The diverse clothing options can also open up discussions about different professions and cultures. Fashion Play Toys ensures that all wooden and magnetic materials are safe, non-toxic, and durable, providing a mess-free, portable, and developmentally rich play experience that appeals to a wide range of ages.",
    "pictureURL": "https://i.ibb.co.com/9kXXhfr1/d12.jpg",
    "subCategory": "Dolls & Accessories"
  },
  {
    "toyId": 13,
    "toyName": "Chemistry Lab Starter Set",
    "sellerName": "Junior Genius Kits",
    "sellerEmail": "support@juniorgenius.com",
    "price": 55.75,
    "rating": 4.6,
    "availableQuantity": 50,
    "description": "The **Chemistry Lab Starter Set** from Junior Genius Kits is meticulously designed to provide a safe, authentic, and foundational introduction to the fascinating world of chemical science for budding young chemists. This is an upgrade from typical 'toy' chemistry sets, featuring **real, high-quality, shatter-resistant glassware** (including beakers and test tubes scaled for child use) and precise measuring tools, giving children the genuine feel of working in a professional laboratory. The set includes a carefully curated collection of **safe, non-toxic household chemicals** (like baking soda, citric acid, and litmus paper) along with child-friendly formulas for creating common, non-hazardous reactions.\n\nSafety and education are the top priorities. The kit includes essential protective gear, such as child-sized goggles, and all chemical components are pre-measured and non-toxic, ensuring that the experiments are exciting without being dangerous. The included **detailed, full-color experiment manual** is the cornerstone of the set, featuring over 30 step-by-step experiments that are clearly categorized by difficulty. The manual doesn't just provide instructions; it offers clear, concise explanations of the underlying **chemical principles**, such as acid-base reactions, crystallization, density changes, and gas production. This pedagogical approach ensures children understand the *why* behind the *what*, moving them beyond simple observation to genuine scientific comprehension.\n\nWorking with this set profoundly enhances **scientific literacy** and **critical thinking**. Children learn to follow complex procedures, meticulously measure quantities, observe reactions with a keen eye, and document their findings—the fundamental tenets of the scientific method. The tangible nature of the experiments makes abstract concepts concrete, dramatically increasing engagement and retention. It is an excellent tool for developing **precision and fine motor control**, which are necessary for handling the glassware and pipettes. The Chemistry Lab Starter Set encourages a sense of **intellectual curiosity** and **independence**, allowing children to conduct their own research and experimentation safely. By providing a truly authentic, high-quality laboratory experience, Junior Genius Kits aims to demystify science and inspire a lifelong passion for scientific inquiry.",
    "pictureURL": "https://i.ibb.co.com/Nd9XW1KT/d13.png",
    "subCategory": "Educational"
  },
  {
    "toyId": 14,
    "toyName": "Police Interceptor Diecast",
    "sellerName": "Collector's Diecast",
    "sellerEmail": "info@collectordiecast.com",
    "price": 9.99,
    "rating": 4.8,
    "availableQuantity": 250,
    "description": "The **Police Interceptor Diecast** model is a high-quality, meticulously crafted replica that appeals equally to young enthusiasts of vehicles and serious adult collectors. Rendered in a classic **1:64 scale**, the figure perfectly captures the authentic look and feel of a traditional police interceptor. The body is made from durable, heavy-duty diecast metal, giving it a satisfying weight and a premium feel that distinguishes it from lighter, less durable plastic toys. The attention to detail is remarkable, featuring realistic exterior paintwork, official-looking decals, accurate light bar details (non-functioning for safety), and a detailed interior viewable through clear plastic windows.\n\nThis diecast model is built for both rugged play and display. Its robust construction ensures it can withstand high-speed floor races and imaginative chase scenarios. The free-rolling wheels are attached to a sturdy axle, allowing for smooth, fast movement across various indoor surfaces. The small scale makes it perfectly sized for a child's hand, enhancing **fine motor manipulation** and making it an excellent take-along toy for road trips or appointments. While it is marketed for ages 3 and up due to the general size, its detail and quality also make it a valuable addition to any mature diecast collection.\n\nFrom a developmental standpoint, this toy fosters **imaginative play** and **narrative construction**. Children often use the vehicle to act out complex rescue missions, traffic control scenarios, and high-speed pursuits, which significantly boosts their **storytelling skills** and understanding of community roles and public service. It encourages children to explore themes of law, order, and heroism. For collectors, the model serves as a historical and cultural artifact, often sparking interest in automotive design, law enforcement history, and the intricacies of model making. The high rating for this particular model reflects the exceptional balance of playability and collectible quality that Collector's Diecast is known for. It represents a fantastic, affordable option that provides hours of imaginative entertainment while introducing children to the satisfying weight and detail of a quality diecast miniature.",
    "pictureURL": "https://i.ibb.co.com/8LztMpLd/d14.webp",
    "subCategory": "Vehicles"
  },
  {
    "toyId": 15,
    "toyName": "Kinetic Sand Castle Set",
    "sellerName": "Sensory Play Co.",
    "sellerEmail": "contact@sensoryplay.net",
    "price": 29.00,
    "rating": 4.9,
    "availableQuantity": 95,
    "description": "The **Kinetic Sand Castle Set** is the ultimate indoor sensory experience, providing the fun of a sandbox without the mess and cleanup. This set includes a generous **2 lbs of premium-quality, non-toxic kinetic sand**—a unique substance composed of $98 $ pure sand and $2 $ polymer that causes the grains to stick only to themselves, allowing it to be easily molded and sculpted while remaining dry to the touch and incredibly easy to clean. The included sand comes in a natural, vibrant color that perfectly mimics real beach sand.\n\nCentral to the set is a collection of **six castle-themed molds**, including turrets, walls, towers, and a full castle gateway, allowing children to build magnificent, detailed fortresses right on a kitchen table. The sand's unique property means that structures can be molded with incredible precision yet still flow and trickle when handled gently, offering a mesmerizing, tactile sensation. One of the most significant features of kinetic sand is that it **never dries out**, ensuring the set is always ready for play and does not require sealing or special storage beyond its original container, guaranteeing exceptional longevity.\n\nAs a **sensory toy**, this product is highly beneficial for childhood development. Manipulating the sand provides a calming, **therapeutic tactile input**, which can help children focus, reduce stress, and self-regulate emotions. The repetitive motions of scooping, patting, and molding are excellent for refining **fine motor skills** and strengthening the small muscles in the hands. Creatively, building the castles encourages **imaginative play** and **spatial reasoning**, as children must visualize their finished structure and select the appropriate molds to achieve their design. It is also an inclusive activity, suitable for various skill levels and a great medium for parallel play. The high 4.9 rating attests to the superior quality of the sand and molds provided by Sensory Play Co., making this set a beloved, mess-free alternative to traditional sand that provides hours of imaginative, sensory-rich exploration.",
    "pictureURL": "https://i.ibb.co.com/ZpYpW0Nt/d15.png",
    "subCategory": "Sensory Toys"
  },
  {
    "toyId": 16,
    "toyName": "Viking Warrior Figure",
    "sellerName": "Fantasy Collectibles",
    "sellerEmail": "sales@fantasyfigs.com",
    "price": 18.25,
    "rating": 4.0,
    "availableQuantity": 130,
    "description": "The **Viking Warrior Figure** is an impressive, historically-inspired action figure from Fantasy Collectibles, designed to bring the drama and adventure of the Viking Age to life. Standing at a playable and collectible **6-inch scale**, the figure is meticulously detailed to depict a formidable Norse warrior. It is crafted from durable, high-grade PVC plastic that is non-toxic and built to withstand the rigors of adventurous play. The sculpt features intricate armor, flowing robes, and realistic facial features that give the figure a fierce, authentic look, appealing equally to children who love action and history buffs.\n\nThis is a highly **articulated action figure**, boasting multiple points of articulation at the neck, shoulders, elbows, wrists, waist, hips, and knees. This superior range of motion allows children to pose the warrior in hundreds of dynamic stances, from battle-ready charges to triumphant victory poses, dramatically enhancing the playability and realism of combat scenarios. The figure comes complete with a set of essential **accessories**, including a detailed Viking helmet (sometimes removable), a massive battle axe, and a round shield, all designed to fit securely in the figure’s hands, allowing for complex and exciting role-playing.\n\nThe Viking theme is an excellent educational gateway, sparking interest in **European history, mythology, and culture**. Playing with the figure encourages children to ask questions about the Viking lifestyle, their longships, their sagas, and their exploration, fostering a natural curiosity that extends beyond the toy itself. For younger users, manipulating the figure and its small accessories is a brilliant way to develop **fine motor control** and **dexterity**. Most importantly, the figure serves as a powerful prop for **imaginative and narrative play**, allowing children to construct epic tales of long voyages, heroic battles, and mythical creatures, significantly enhancing their **language development** and **storytelling abilities**. The Viking Warrior Figure is a compelling, high-quality toy that bridges the gap between historical curiosity and action-packed fun, providing an enriching play experience for any child interested in legendary warriors and epic adventures.",
    "pictureURL": "https://i.ibb.co.com/r2Fydjj7/d16.png",
    "subCategory": "Action Figures"
  },
  {
    "toyId": 17,
    "toyName": "Giant Bubble Wand Kit",
    "sellerName": "Outdoor Fun Games",
    "sellerEmail": "hello@outdoorfungames.com",
    "price": 14.50,
    "rating": 4.7,
    "availableQuantity": 160,
    "description": "The **Giant Bubble Wand Kit** from Outdoor Fun Games is an absolute outdoor essential, promising awe-inspiring, massive bubbles that captivate children and adults alike. This kit is specifically designed to create bubbles that are dramatically larger than standard soap bubbles—often stretching several feet long—transforming an ordinary afternoon into a magical, unforgettable experience. The heart of the kit is the specialized **oversized wand**, constructed from two durable, lightweight, plastic handles connected by a loop of highly absorbent, thick cotton rope. This unique design is essential for holding the maximum amount of solution and creating the necessary tension for forming truly gigantic bubbles.\n\nThe kit comes complete with a large bottle of **high-performance, concentrated bubble solution**, which is non-toxic, biodegradable, and specially formulated for maximum bubble size and durability. Unlike thin, store-bought solutions, this formula creates a strong, resilient film that allows the bubbles to float further and last longer, often leading to record-breaking sizes. The set also includes a wide dipping tray, making it easy to fully soak the giant wands without unnecessary mess or waste. The entire kit is designed for immediate, hassle-free outdoor fun.\n\nFrom a developmental standpoint, bubble play is wonderfully simple yet highly effective. Chasing and popping the enormous bubbles encourages essential **gross motor skills**, including running, leaping, and bending, promoting physical activity and coordination in the open air. The act of creating the bubbles—moving the wand through the air at the correct speed and angle—requires focus and precision, subtly enhancing **fine motor control** and **hand-eye coordination**. It also introduces elementary concepts of **physics**, such as air resistance, surface tension, and wind direction, in a completely tangible and fun way. Furthermore, the sheer wonder of seeing a giant bubble is a powerful way to stimulate a child’s **sense of wonder and curiosity**, often leading to spontaneous creative play and laughter. The Giant Bubble Wand Kit is the perfect, low-cost investment for encouraging active, joyful, and shared outdoor family time.",
    "pictureURL": "https://i.ibb.co.com/pvZhG8pr/d17.png",
    "subCategory": "Outdoor Play"
  },
  {
    "toyId": 18,
    "toyName": "DIY Friendship Bracelet Kit",
    "sellerName": "Crafty Corner Store",
    "sellerEmail": "info@craftycorner.org",
    "price": 21.00,
    "rating": 4.4,
    "availableQuantity": 70,
    "description": "The **DIY Friendship Bracelet Kit** from Crafty Corner Store is a comprehensive and creative set designed to introduce children to the rewarding craft of jewelry making, fostering both artistic expression and social connection. This all-in-one kit is packed with a wide spectrum of materials, including over **30 skeins of high-quality embroidery floss** in every color imaginable, a generous assortment of **various beads** (alphabet, metallic, and colorful plastic), and all the necessary tools like safety pins, a foam loom or clipboard, and small scissors. The kit's materials are all non-toxic and specifically chosen for ease of use by younger hands, minimizing frustration and maximizing the fun of the creative process.\n\nThe centerpiece of the kit is the **full-color, beginner-friendly instruction book**. This guide features clear, step-by-step diagrams and instructions for creating **20 unique friendship bracelet designs**, ranging from simple braids and twists to more complex patterns like the chevron, candy stripe, and macramé knots. The sequential learning provided by the book allows children to build their skills progressively, moving from simple techniques to master craftsmanship.\n\nCreating friendship bracelets is a wonderful developmental activity. It is an exceptional way to dramatically boost **fine motor skills** and **hand-eye coordination**, as the precise threading of beads and the consistent tension required for knotting strengthens finger dexterity. The process encourages **patience, focus, and adherence to instructions**, teaching children the satisfaction of completing a challenging, long-term project. Beyond the technical skills, the core value of this kit is social. The bracelets are designed to be **made and shared**, fostering a sense of **community, generosity, and thoughtful connection** among friends and family. The finished bracelets are tangible tokens of affection, reinforcing bonds and making them a meaningful gift. The DIY Friendship Bracelet Kit offers a productive, screen-free, creative outlet that yields beautiful, wearable art and strengthens the most important relationships in a child’s life, making it a highly cherished and re-playable craft set.",
    "pictureURL": "https://i.ibb.co.com/Z6pQhgzG/d18.png",
    "subCategory": "Arts & Crafts"
  },
  {
    "toyId": 19,
    "toyName": "Robot Dog Programmable",
    "sellerName": "Future Tech Toys",
    "sellerEmail": "contact@futuretech.com",
    "price": 89.99,
    "rating": 4.9,
    "availableQuantity": 40,
    "description": "The **Robot Dog Programmable** from Future Tech Toys is a cutting-edge, interactive companion that serves as an engaging and fun introduction to the fundamentals of **coding, robotics, and artificial intelligence**. More than just a remote-control toy, this sophisticated robot dog can be taught a variety of commands and behaviors, making the complex subjects of programming and engineering accessible to young minds. The robot is built with a high-quality, durable plastic exterior and features multi-directional wheels or articulated legs that allow for smooth and complex movement across various surfaces, mimicking the playful gait of a real pet.\n\nIts key features include **voice command recognition**, allowing the child to train the robot to respond to their spoken words with predefined tricks like sitting, flipping, or performing a dance. The core educational component is the **programmability**. The robot is compatible with an intuitive, drag-and-drop visual programming language (often based on Scratch) accessible via a free companion app on a tablet or smartphone. This interface allows children to chain together sequences of actions, lights, and sounds, teaching them the principles of **algorithmic thinking, logical sequencing, and debugging** in a tangible, low-pressure environment. When a sequence doesn't work, the robot's malfunction provides immediate feedback, encouraging the child to analyze and correct their code.\n\nThe robot dog also includes various **sensors** (touch, sound, and obstacle avoidance), which allow it to interact dynamically with its environment and the user, further deepening the child's understanding of how inputs and outputs function in robotics. This interactive pet fosters a sense of **responsibility and nurturing**, similar to a real pet, but with the added layer of technical learning. The high 4.9-star rating underscores the quality of the programming interface and the engaging nature of the toy. The Robot Dog Programmable is a substantial investment in a child’s STEM future, providing a playful yet profound hands-on experience that demystifies technology and cultivates essential 21st-century skills in a fun and innovative way.",
    "pictureURL": "https://i.ibb.co.com/jPyfdxs3/d19.webp",
    "subCategory": "Robotics"
  },
  {
    "toyId": 20,
    "toyName": "World Map Floor Puzzle",
    "sellerName": "Globe Trotter Puzzles",
    "sellerEmail": "sales@globepuzzle.net",
    "price": 31.95,
    "rating": 4.6,
    "availableQuantity": 100,
    "description": "The **World Map Floor Puzzle** is a massive, visually stunning, and highly educational toy designed to introduce children to world geography in a fun, tangible way. When completed, this 100-piece puzzle forms an impressive, durable **4-foot wide map** of the world, making it a centerpiece for learning and play. The pieces are extra-large and thick, made from high-quality, recycled cardboard with a durable, easy-to-clean, non-toxic finish, ensuring they can withstand enthusiastic assembly on the floor for years. The sheer scale encourages movement and physical engagement, as children must walk around the puzzle to place pieces.\n\nThe map's design is rich with **educational content**. It clearly labels all the major **continents, oceans, and countries** and is illustrated with charming, colorful graphics that represent famous landmarks, indigenous animals, and cultural icons specific to each region (e.g., the Eiffel Tower in France, kangaroos in Australia, or polar bears in the Arctic). This visual key provides a context for learning and sparks immediate curiosity about different cultures and environments.\n\nCompleting a floor puzzle of this magnitude offers significant developmental benefits. The large, varied shapes of the 100 pieces require advanced **spatial reasoning** and **logical deduction** as the child must work with a large-scale image. It dramatically improves **problem-solving skills** and **visual-perceptual abilities**. Because of its size, it is a perfect toy for **collaborative play**, encouraging communication, teamwork, and turn-taking as multiple children or family members work together to complete the world. Most importantly, the map is a powerful tool for **geography and global awareness**. Assembling the continents and discussing the illustrated features helps children understand relative size, location, and the diversity of the planet, making abstract concepts of geography concrete and accessible. The World Map Floor Puzzle from Globe Trotter Puzzles transforms learning about the world into an immersive, active, and rewarding experience that offers a beautiful, completed piece of artwork as a satisfying result.",
    "pictureURL": "https://i.ibb.co.com/TBmX0WGh/d20.png",
    "subCategory": "Puzzles"
  }
]